app/controllers/business_case_controller.rb

  def index
    @business_cases = BusinessCase.all
---
SELECT "business_cases".* FROM "business_cases"

  def create
    @business_case = BusinessCase.create title: params["title"]
---
INSERT INTO "business_cases" ("client_problem", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["client_problem", "Ca c'est un vrai probleme !...\r\n"], ["created_at", "2018-04-27 09:43:49.374380"], ["updated_at", "2018-04-27 09:43:49.374380"], ["title", "Comment creer un biz case ?"]]

  def show
    id = params["id"]
    @business_case = BusinessCase.where(id: id).first
---
SELECT  "business_cases".* FROM "business_cases" WHERE "business_cases"."id" = ? ORDER BY "business_cases"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def edit
    id = params["id"]
    @business_case = BusinessCase.where(id: id).first
---
SELECT  "business_cases".* FROM "business_cases" WHERE "business_cases"."id" = ? ORDER BY "business_cases"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    id = params["id"]
    @business_case = BusinessCase.where(id: id).first
    @business_case.title = params["title"]
    if @business_case.save
---
SELECT  "business_cases".* FROM "business_cases" WHERE "business_cases"."id" = ? ORDER BY "business_cases"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "business_cases" SET "industry" = ?, "corporate_size" = ?, "localisation" = ?, "expertise" = ?, "updated_at" = ? WHERE "business_cases"."id" = ?  [["industry", "Voyage et loisirs"], ["corporate_size", ">1000m"], ["localisation", "Moyen-Orient"], ["expertise", "Sales & Marketing"], ["updated_at", "2018-06-05 14:35:23.996736"], ["id", 19]]

  def delete
    id = params["id"]
    @business_case = BusinessCase.where(id: id).first
---
SELECT  "business_cases".* FROM "business_cases" WHERE "business_cases"."id" = ? ORDER BY "business_cases"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def destroy
    id = params["id"]
    business_case = BusinessCase.where(id: id).first
    business_case.destroy
---
SELECT  "business_cases".* FROM "business_cases" WHERE "business_cases"."id" = ? ORDER BY "business_cases"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "business_cases" WHERE "business_cases"."id" = ?  [["id", 6]]