app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @var = "Salut je suis accesible"
    @users = User.all